## Обязательное задание

# Написать программу, которая должна:

# - Запросить у пользователя строку с оценками, разделёнными пробелами (например, 5 4 3 5 2 5 4). 
# - Преобразовать её в список целых чисел (через `split()` и генератор списка).
# - Проверить, что все оценки в диапазоне от 1 до 5. Если есть некорректные - вывести сообщение и завершить программу.

# Вывести:

# - сам список;
# - количество оценок (`len()`);
# - сумму и среднее арифметическое (`sum()`);
# - минимальную и максимальную оценку (`min()`, `max()`).

input_str = input("Введите через проблесы числа: ")

print(input_str)

raw_range_list = input_str.split(" ")
range_list = [int(elem) for elem in raw_range_list if elem.isdigit()]

print(range_list)

range_count = len(range_list)

range_sum = sum(range_list)
range_avg = range_sum / range_count

print(f"Общее количество оценок: {range_count}")